[
    [
        "Jane asked which maintenance man it appeared that his supervisor might have already spoken with regarding the food-fight in the cafeteria.",
        "Jane asked which maintenance man it appeared that Donna might have already spoken with regarding the food-fight in the cafeteria.",
        "Jane asked which maintenance man had said that his supervisor might have already spoken with regarding the food-fight in the cafeteria.",
        "Jane asked which maintenance man had said that Donna might have already spoken with regarding the food-fight in the cafeteria.",
        "Jane asked which lunch lady it appeared that his supervisor might have already spoken with regarding the food-fight in the cafeteria.",
        "Jane asked which lunch lady it appeared that Donna might have already spoken with regarding the food-fight in the cafeteria.",
        "Jane asked which lunch lady had said that his supervisor might have already spoken with regarding the food-fight in the cafeteria.",
        "Jane asked which lunch lady had said that Donna might have already spoken with regarding the food-fight in the cafeteria."
    ],
    [
        "Lily wondered which tailor it seemed that his apprentice could have recently called on for sewing assistance before the wedding.",
        "Lily wondered which tailor it seemed that Alice could have recently called on for sewing assistance before the wedding.",
        "Lily wondered which tailor had said that his apprentice could have recently called on for sewing assistance before the wedding.",
        "Lily wondered which tailor had said that Alice could have recently called on for sewing assistance before the wedding.",
        "Lily wondered which seamstress it seemed that his apprentice could have recently called on for sewing assistance before the wedding.",
        "Lily wondered which seamstress it seemed that Alice could have recently called on for sewing assistance before the wedding.",
        "Lily wondered which seamstress had said that his apprentice could have recently called on for sewing assistance before the wedding.",
        "Lily wondered which seamstress had said that Alice could have recently called on for sewing assistance before the wedding."
    ],
    [
        "Mary knew which policeman it appeared that his partner should have immediately talked to after the accident on the highway.",
        "Mary knew which policeman it appeared that Hailey should have immediately talked to after the accident on the highway.",
        "Mary knew which policeman had admitted that his partner should have immediately talked to after the accident on the highway.",
        "Mary knew which policeman had admitted that Hailey should have immediately talked to after the accident on the highway.",
        "Mary knew which policewoman it appeared that his partner should have immediately talked to after the accident on the highway.",
        "Mary knew which policewoman it appeared that Hailey should have immediately talked to after the accident on the highway.",
        "Mary knew which policewoman had admitted that his partner should have immediately talked to after the accident on the highway.",
        "Mary knew which policewoman had admitted that Hailey should have immediately talked to after the accident on the highway."
    ],
    [
        "Christina remembered which fireman it seemed that his buddy should have immediately reported to after the catastrophe in the city.",
        "Christina remembered which fireman it seemed that Diane should have immediately reported to after the catastrophe in the city.",
        "Christina remembered which fireman had admitted that his buddy should have immediately reported to after the catastrophe in the city.",
        "Christina remembered which fireman had admitted that Diane should have immediately reported to after the catastrophe in the city.",
        "Christina remembered mother it seemed that his buddy should have immediately reported to after the catastrophe in the city.",
        "Christina remembered mother it seemed that Diane should have immediately reported to after the catastrophe in the city.",
        "Christina remembered mother had admitted that his buddy should have immediately reported to after the catastrophe in the city.",
        "Christina remembered mother had admitted that Diane should have immediately reported to after the catastrophe in the city."
    ],
    [
        "Olivia said which doctor it appeared that his associate might have already spoken with about the prognosis for good recovery.",
        "Olivia said which doctor it appeared that Kaitlyn might have already spoken with about the prognosis for good recovery.",
        "Olivia said which doctor had thought that his associate might have already spoken with about the prognosis for good recovery.",
        "Olivia said which doctor had thought that Kaitlyn might have already spoken with about the prognosis for good recovery.",
        "Olivia said which midwife it appeared that his associate might have already spoken with about the prognosis for good recovery.",
        "Olivia said which midwife it appeared that Kaitlyn might have already spoken with about the prognosis for good recovery.",
        "Olivia said which midwife had thought that his associate might have already spoken with about the prognosis for good recovery.",
        "Olivia said which midwife had thought that Kaitlyn might have already spoken with about the prognosis for good recovery."
    ],
    [
        "Jessica asked which cowboy it seemed that his employer should have actually fought with during the cattle-drive on the ranch.",
        "Jessica asked which cowboy it seemed that Theresa should have actually fought with during the cattle-drive on the ranch.",
        "Jessica asked which cowboy had thought that his employer should have actually fought with during the cattle-drive on the ranch.",
        "Jessica asked which cowboy had thought that Theresa should have actually fought with during the cattle-drive on the ranch.",
        "Jessica asked which cowgirl it seemed that his employer should have actually fought with during the cattle-drive on the ranch.",
        "Jessica asked which cowgirl it seemed that Theresa should have actually fought with during the cattle-drive on the ranch.",
        "Jessica asked which cowgirl had thought that his employer should have actually fought with during the cattle-drive on the ranch.",
        "Jessica asked which cowgirl had thought that Theresa should have actually fought with during the cattle-drive on the ranch."
    ],
    [
        "Ashley wondered which gangster it appeared that his rival should have probably gone after in the alleyway during the sting.",
        "Ashley wondered which gangster it appeared that Susanne should have probably gone after in the alleyway during the sting.",
        "Ashley wondered which gangster had said that his rival should have probably gone after in the alleyway during the sting.",
        "Ashley wondered which gangster had said that Susanne should have probably gone after in the alleyway during the sting.",
        "Ashley wondered which prostitute it appeared that his rival should have probably gone after in the alleyway during the sting.",
        "Ashley wondered which prostitute it appeared that Susanne should have probably gone after in the alleyway during the sting.",
        "Ashley wondered which prostitute had said that his rival should have probably gone after in the alleyway during the sting.",
        "Ashley wondered which prostitute had said that Susanne should have probably gone after in the alleyway during the sting."
    ],
    [
        "Emily knew which judge it seemed that his colleague must have actually disagreed with about the ruling by the court.",
        "Emily knew which judge it seemed that Eve must have actually disagreed with about the ruling by the court.",
        "Emily knew which judge had said that his colleague must have actually disagreed with about the ruling by the court.",
        "Emily knew which judge had said that Eve must have actually disagreed with about the ruling by the court.",
        "Emily knew which typist it seemed that his colleague must have actually disagreed with about the ruling by the court.",
        "Emily knew which typist it seemed that Eve must have actually disagreed with about the ruling by the court.",
        "Emily knew which typist had said that his colleague must have actually disagreed with about the ruling by the court.",
        "Emily knew which typist had said that Eve must have actually disagreed with about the ruling by the court."
    ],
    [
        "Sarah remembered which monk it appeared that his abbott might have privately talked to in the rectory after the mass.",
        "Sarah remembered which monk it appeared that Nora might have privately talked to in the rectory after the mass.",
        "Sarah remembered which monk had confessed that his abbott might have privately talked to in the rectory after the mass.",
        "Sarah remembered which monk had confessed that Nora might have privately talked to in the rectory after the mass.",
        "Sarah remembered which nun it appeared that his abbott might have privately talked to in the rectory after the mass.",
        "Sarah remembered which nun it appeared that Nora might have privately talked to in the rectory after the mass.",
        "Sarah remembered which nun had confessed that his abbott might have privately talked to in the rectory after the mass.",
        "Sarah remembered which nun had confessed that Nora might have privately talked to in the rectory after the mass."
    ],
    [
        "Megan said which engineer it seemed that his manager might have actually agreed with about the blueprints for the skyscraper.",
        "Megan said which engineer it seemed that Christine might have actually agreed with about the blueprints for the skyscraper.",
        "Megan said which engineer had admitted that his manager might have actually agreed with about the blueprints for the skyscraper.",
        "Megan said which engineer had admitted that Christine might have actually agreed with about the blueprints for the skyscraper.",
        "Megan said which secretary it seemed that his manager might have actually agreed with about the blueprints for the skyscraper.",
        "Megan said which secretary it seemed that Christine might have actually agreed with about the blueprints for the skyscraper.",
        "Megan said which secretary had admitted that his manager might have actually agreed with about the blueprints for the skyscraper.",
        "Megan said which secretary had admitted that Christine might have actually agreed with about the blueprints for the skyscraper."
    ],
    [
        "Hannah couldn't remember which boy scout it appeared that his leader would have gone fishing with on troop trips in the summers.",
        "Hannah couldn't remember which boy scout it appeared that Bridget would have gone fishing with on troop trips in the summers.",
        "Hannah couldn't remember which boy scout had implied that his leader would have gone fishing with on troop trips in the summers.",
        "Hannah couldn't remember which boy scout had implied that Bridget would have gone fishing with on troop trips in the summers.",
        "Hannah couldn't remember which girl scout it appeared that his leader would have gone fishing with on troop trips in the summers.",
        "Hannah couldn't remember which girl scout it appeared that Bridget would have gone fishing with on troop trips in the summers.",
        "Hannah couldn't remember which girl scout had implied that his leader would have gone fishing with on troop trips in the summers.",
        "Hannah couldn't remember which girl scout had implied that Bridget would have gone fishing with on troop trips in the summers."
    ],
    [
        "Lauren couldn't remember which soldier it seemed that his sergeant might have secretly conspired with to steal provisions from the infirmary.",
        "Lauren couldn't remember which soldier it seemed that Catherine might have secretly conspired with to steal provisions from the infirmary.",
        "Lauren couldn't remember which soldier had disclosed that his sergeant might have secretly conspired with to steal provisions from the infirmary.",
        "Lauren couldn't remember which soldier had disclosed that Catherine might have secretly conspired with to steal provisions from the infirmary.",
        "Lauren couldn't remember which nurse it seemed that his sergeant might have secretly conspired with to steal provisions from the infirmary.",
        "Lauren couldn't remember which nurse it seemed that Catherine might have secretly conspired with to steal provisions from the infirmary.",
        "Lauren couldn't remember which nurse had disclosed that his sergeant might have secretly conspired with to steal provisions from the infirmary.",
        "Lauren couldn't remember which nurse had disclosed that Catherine might have secretly conspired with to steal provisions from the infirmary."
    ],
    [
        "Michael asked which stripper it appeared that her admirer should have immediately looked for outside the club after last call.",
        "Michael asked which stripper it appeared that Omar should have immediately looked for outside the club after last call.",
        "Michael asked which stripper had said that her admirer should have immediately looked for outside the club after last call.",
        "Michael asked which stripper had said that Omar should have immediately looked for outside the club after last call.",
        "Michael asked which bouncer it appeared that her admirer should have immediately looked for outside the club after last call.",
        "Michael asked which bouncer it appeared that Omar should have immediately looked for outside the club after last call.",
        "Michael asked which bouncer had said that her admirer should have immediately looked for outside the club after last call.",
        "Michael asked which bouncer had said that Omar should have immediately looked for outside the club after last call."
    ],
    [
        "Christopher wondered which aunt it appeared that her nephew could have easily corresponded with according to staff at the retirement home.",
        "Christopher wondered which aunt it appeared that Felix could have easily corresponded with according to staff at the retirement home.",
        "Christopher wondered which aunt had said that her nephew could have easily corresponded with according to staff at the retirement home.",
        "Christopher wondered which aunt had said that Felix could have easily corresponded with according to staff at the retirement home.",
        "Christopher wondered which uncle it appeared that her nephew could have easily corresponded with according to staff at the retirement home.",
        "Christopher wondered which uncle it appeared that Felix could have easily corresponded with according to staff at the retirement home.",
        "Christopher wondered which uncle had said that her nephew could have easily corresponded with according to staff at the retirement home.",
        "Christopher wondered which uncle had said that Felix could have easily corresponded with according to staff at the retirement home."
    ],
    [
        "Matthew knew which nanny it seemed that her employer would get stuck waiting for during afternoon dismissal outside the school.",
        "Matthew knew which nanny it seemed that her Jorge would get stuck waiting for during afternoon dismissal outside the school.",
        "Matthew knew which nanny had claimed that her employer would get stuck waiting for during afternoon dismissal outside the school.",
        "Matthew knew which nanny had claimed that her Jorge would get stuck waiting for during afternoon dismissal outside the school.",
        "Matthew knew which boy it seemed that her employer would get stuck waiting for during afternoon dismissal outside the school.",
        "Matthew knew which boy it seemed that her Jorge would get stuck waiting for during afternoon dismissal outside the school.",
        "Matthew knew which boy had claimed that her employer would get stuck waiting for during afternoon dismissal outside the school.",
        "Matthew knew which boy had claimed that her Jorge would get stuck waiting for during afternoon dismissal outside the school."
    ],
    [
        "Joshua remembered which princess it appeared that her advisor would have discreetly taken aside during the ball to discuss rumors.",
        "Joshua remembered which princess it appeared that Brian would have discreetly taken aside during the ball to discuss rumors.",
        "Joshua remembered which princess had said that her advisor would have discreetly taken aside during the ball to discuss rumors.",
        "Joshua remembered which princess had said that Brian would have discreetly taken aside during the ball to discuss rumors.",
        "Joshua remembered which prince it appeared that her advisor would have discreetly taken aside during the ball to discuss rumors.",
        "Joshua remembered which prince it appeared that Brian would have discreetly taken aside during the ball to discuss rumors.",
        "Joshua remembered which prince had said that her advisor would have discreetly taken aside during the ball to discuss rumors.",
        "Joshua remembered which prince had said that Brian would have discreetly taken aside during the ball to discuss rumors."
    ],
    [
        "Jacob found out which maid it seemed that her supervisor would have gladly spied on during the lunch-break for the investigators.",
        "Jacob found out which maid it seemed that Brad would have gladly spied on during the lunch-break for the investigators.",
        "Jacob found out which maid had insisted that her supervisor would have gladly spied on during the lunch-break for the investigators.",
        "Jacob found out which maid had insisted that Brad would have gladly spied on during the lunch-break for the investigators.",
        "Jacob found out which butler it seemed that her supervisor would have gladly spied on during the lunch-break for the investigators.",
        "Jacob found out which butler it seemed that Brad would have gladly spied on during the lunch-break for the investigators.",
        "Jacob found out which butler had insisted that her supervisor would have gladly spied on during the lunch-break for the investigators.",
        "Jacob found out which butler had insisted that Brad would have gladly spied on during the lunch-break for the investigators."
    ],
    [
        "Nick asked which sorority girl it appeared that her sisters would have definitely bumped into at the mixer during welcome week.",
        "Nick asked which sorority girl it appeared that Mandy would have definitely bumped into at the mixer during welcome week.",
        "Nick asked which sorority girl had thought that her sisters would have definitely bumped into at the mixer during welcome week.",
        "Nick asked which sorority girl had thought that Mandy would have definitely bumped into at the mixer during welcome week.",
        "Nick asked which frat boy it appeared that her sisters would have definitely bumped into at the mixer during welcome week.",
        "Nick asked which frat boy it appeared that Mandy would have definitely bumped into at the mixer during welcome week.",
        "Nick asked which frat boy had thought that her sisters would have definitely bumped into at the mixer during welcome week.",
        "Nick asked which frat boy had thought that Mandy would have definitely bumped into at the mixer during welcome week."
    ],
    [
        "Andrew wondered which receptionist it seemed that her manager could have already spoken to about the benefits of dental insurance.",
        "Andrew wondered which receptionist it seemed that Peter could have already spoken to about the benefits of dental insurance.",
        "Andrew wondered which receptionist had said that her manager could have already spoken to about the benefits of dental insurance.",
        "Andrew wondered which receptionist had said that Peter could have already spoken to about the benefits of dental insurance.",
        "Andrew wondered which dentist it seemed that her manager could have already spoken to about the benefits of dental insurance.",
        "Andrew wondered which dentist it seemed that Peter could have already spoken to about the benefits of dental insurance.",
        "Andrew wondered which dentist had said that her manager could have already spoken to about the benefits of dental insurance.",
        "Andrew wondered which dentist had said that Peter could have already spoken to about the benefits of dental insurance."
    ],
    [
        "Daniel knew which waitress it appeared that her friend must have already worked with during dinner rush on Tuesday night.",
        "Daniel knew which waitress it appeared that Tina must have already worked with during dinner rush on Tuesday night.",
        "Daniel knew which waitress had complained that her friend must have already worked with during dinner rush on Tuesday night.",
        "Daniel knew which waitress had complained that Tina must have already worked with during dinner rush on Tuesday night.",
        "Daniel knew which waiter it appeared that her friend must have already worked with during dinner rush on Tuesday night.",
        "Daniel knew which waiter it appeared that Tina must have already worked with during dinner rush on Tuesday night.",
        "Daniel knew which waiter had complained that her friend must have already worked with during dinner rush on Tuesday night.",
        "Daniel knew which waiter had complained that Tina must have already worked with during dinner rush on Tuesday night."
    ],
    [
        "Tyler remembered which nurse it seemed her patient should have immediately talked to after the outbreak in the ward.",
        "Tyler remembered which nurse it seemed Eileen should have immediately talked to after the outbreak in the ward.",
        "Tyler remembered which nurse had believed that her patient should have immediately talked to after the outbreak in the ward.",
        "Tyler remembered which nurse had believed that Eileen should have immediately talked to after the outbreak in the ward.",
        "Tyler remembered which doctor it seemed her patient should have immediately talked to after the outbreak in the ward.",
        "Tyler remembered which doctor it seemed Eileen should have immediately talked to after the outbreak in the ward.",
        "Tyler remembered which doctor had believed that her patient should have immediately talked to after the outbreak in the ward.",
        "Tyler remembered which doctor had believed that Eileen should have immediately talked to after the outbreak in the ward."
    ],
    [
        "Joseph said which secretary it appeared that her boss should have frequently consulted with with the typing of the reports.",
        "Joseph said which secretary it appeared that Howard should have frequently consulted with with the typing of the reports.",
        "Joseph said which secretary had conceded that her boss should have frequently consulted with with the typing of the reports.",
        "Joseph said which secretary had conceded that Howard should have frequently consulted with with the typing of the reports.",
        "Joseph said which executive it appeared that her boss should have frequently consulted with with the typing of the reports.",
        "Joseph said which executive it appeared that Howard should have frequently consulted with with the typing of the reports.",
        "Joseph said which executive had conceded that her boss should have frequently consulted with with the typing of the reports.",
        "Joseph said which executive had conceded that Howard should have frequently consulted with with the typing of the reports."
    ],
    [
        "Brandon couldn't recall which nun it seemed that her priest might have actually talked with about the interpretation of the scripture.",
        "Brandon couldn't recall which nun it seemed that Paul might have actually talked with about the interpretation of the scripture.",
        "Brandon couldn't recall which nun had thought that her priest might have actually talked with about the interpretation of the scripture.",
        "Brandon couldn't recall which nun had thought that Paul might have actually talked with about the interpretation of the scripture.",
        "Brandon couldn't recall which priest it seemed that her priest might have actually talked with about the interpretation of the scripture.",
        "Brandon couldn't recall which priest it seemed that Paul might have actually talked with about the interpretation of the scripture.",
        "Brandon couldn't recall which priest had thought that her priest might have actually talked with about the interpretation of the scripture.",
        "Brandon couldn't recall which priest had thought that Paul might have actually talked with about the interpretation of the scripture."
    ],
    [
        "David couldn't recall which girl scout it appeared that her mother could have actually worked with during the fundraiser for new uniforms.",
        "David couldn't recall which girl scout it appeared that Jeff could have actually worked with during the fundraiser for new uniforms.",
        "David couldn't recall which girl scout had believed that her mother could have actually worked with during the fundraiser for new uniforms.",
        "David couldn't recall which girl scout had believed that Jeff could have actually worked with during the fundraiser for new uniforms.",
        "David couldn't recall which boy scout it appeared that her mother could have actually worked with during the fundraiser for new uniforms.",
        "David couldn't recall which boy scout it appeared that Jeff could have actually worked with during the fundraiser for new uniforms.",
        "David couldn't recall which boy scout had believed that her mother could have actually worked with during the fundraiser for new uniforms.",
        "David couldn't recall which boy scout had believed that Jeff could have actually worked with during the fundraiser for new uniforms."
    ],
    [
        "Mary asked which knight it appeared that his compatriots would have valiantly fought for during the joust at the fair.",
        "Mary asked which knight it appeared that Evelyn would have valiantly fought for during the joust at the fair.",
        "Mary asked which knight had declared that his compatriots would have valiantly fought for during the joust at the fair.",
        "Mary asked which knight had declared that Evelyn would have valiantly fought for during the joust at the fair.",
        "Mary asked which baroness it appeared that his compatriots would have valiantly fought for during the joust at the fair.",
        "Mary asked which baroness it appeared that Evelyn would have valiantly fought for during the joust at the fair.",
        "Mary asked which baroness had declared that his compatriots would have valiantly fought for during the joust at the fair.",
        "Mary asked which baroness had declared that Evelyn would have valiantly fought for during the joust at the fair."
    ],
    [
        "Sam described which bride it seemed that her girlfriends would have never waited for before the dress-fitting at the store.",
        "Sam described which bride it seemed that Andrew would have never waited for before the dress-fitting at the store.",
        "Sam described which bride had insisted that her girlfriends would have never waited for before the dress-fitting at the store.",
        "Sam described which bride had insisted that Andrew would have never waited for before the dress-fitting at the store.",
        "Sam described which groom it seemed that her girlfriends would have never waited for before the dress-fitting at the store.",
        "Sam described which groom it seemed that Andrew would have never waited for before the dress-fitting at the store.",
        "Sam described which groom had insisted that her girlfriends would have never waited for before the dress-fitting at the store.",
        "Sam described which groom had insisted that Andrew would have never waited for before the dress-fitting at the store."
    ],
    [
        "Eliza questioned which bully it seemed that his victim might have been hiding from behind the slide on the playground.",
        "Eliza questioned which bully it seemed that Harry might have been hiding from behind the slide on the playground.",
        "Eliza questioned which bully had said that his victim might have been hiding from behind the slide on the playground.",
        "Eliza questioned which bully had said that Harry might have been hiding from behind the slide on the playground.",
        "Eliza questioned which girl it seemed that his victim might have been hiding from behind the slide on the playground.",
        "Eliza questioned which girl it seemed that Harry might have been hiding from behind the slide on the playground.",
        "Eliza questioned which girl had said that his victim might have been hiding from behind the slide on the playground.",
        "Eliza questioned which girl had said that Harry might have been hiding from behind the slide on the playground."
    ],
    [
        "Sean asked which ballerina it appeared that her rival could have actually tied with in the exhibition at the gym.",
        "Sean asked which ballerina it appeared that Samantha could have actually tied with in the exhibition at the gym.",
        "Sean asked which ballerina had thought that her rival could have actually tied with in the exhibition at the gym.",
        "Sean asked which ballerina had thought that Samantha could have actually tied with in the exhibition at the gym.",
        "Sean asked which boxer it appeared that her rival could have actually tied with in the exhibition at the gym.",
        "Sean asked which boxer it appeared that Samantha could have actually tied with in the exhibition at the gym.",
        "Sean asked which boxer had thought that her rival could have actually tied with in the exhibition at the gym.",
        "Sean asked which boxer had thought that Samantha could have actually tied with in the exhibition at the gym."
    ],
    [
        "Rosie knew which linebacker it appeared that his interviewer would have rather spoken with for the article in the newspaper.",
        "Rosie knew which linebacker it appeared that Shelly would have rather spoken with for the article in the newspaper.",
        "Rosie knew which linebacker had said that his interviewer would have rather spoken with for the article in the newspaper.",
        "Rosie knew which linebacker had said that Shelly would have rather spoken with for the article in the newspaper.",
        "Rosie knew which cheerleader it appeared that his interviewer would have rather spoken with for the article in the newspaper.",
        "Rosie knew which cheerleader it appeared that Shelly would have rather spoken with for the article in the newspaper.",
        "Rosie knew which cheerleader had said that his interviewer would have rather spoken with for the article in the newspaper.",
        "Rosie knew which cheerleader had said that Shelly would have rather spoken with for the article in the newspaper."
    ],
    [
        "Adam recalled which actress it seemed that her replacement would have rather studied under in the workshops at the conservatory.",
        "Adam recalled which actress it seemed that Ellen would have rather studied under in the workshops at the conservatory.",
        "Adam recalled which actress had implied that her replacement would have rather studied under in the workshops at the conservatory.",
        "Adam recalled which actress had implied that Ellen would have rather studied under in the workshops at the conservatory.",
        "Adam recalled which actor it seemed that her replacement would have rather studied under in the workshops at the conservatory.",
        "Adam recalled which actor it seemed that Ellen would have rather studied under in the workshops at the conservatory.",
        "Adam recalled which actor had implied that her replacement would have rather studied under in the workshops at the conservatory.",
        "Adam recalled which actor had implied that Ellen would have rather studied under in the workshops at the conservatory."
    ],
    [
        "Angela mentioned which professor it seemed claimed that his student would have formally written up for teaching evolution to the class.",
        "Angela mentioned which professor it seemed claimed that Melanie would have formally written up for teaching evolution to the class.",
        "Angela mentioned which professor it had claimed that his student would have formally written up for teaching evolution to the class.",
        "Angela mentioned which professor it had claimed that Melanie would have formally written up for teaching evolution to the class.",
        "Angela mentioned which kindergarten teacher it seemed claimed that his student would have formally written up for teaching evolution to the class.",
        "Angela mentioned which kindergarten teacher it seemed claimed that Melanie would have formally written up for teaching evolution to the class.",
        "Angela mentioned which kindergarten teacher it had claimed that his student would have formally written up for teaching evolution to the class.",
        "Angela mentioned which kindergarten teacher it had claimed that Melanie would have formally written up for teaching evolution to the class."
    ],
    [
        "Benjamin described which salesgirl it appeared that her client would have angrily yelled at for the faulty merchandise in stock.",
        "Benjamin described which salesgirl it appeared that Richard would have angrily yelled at for the faulty merchandise in stock.",
        "Benjamin described which salesgirl had claimed that her client would have angrily yelled at for the faulty merchandise in stock.",
        "Benjamin described which salesgirl had claimed that Richard would have angrily yelled at for the faulty merchandise in stock.",
        "Benjamin described which salesman it appeared that her client would have angrily yelled at for the faulty merchandise in stock.",
        "Benjamin described which salesman it appeared that Richard would have angrily yelled at for the faulty merchandise in stock.",
        "Benjamin described which salesman had claimed that her client would have angrily yelled at for the faulty merchandise in stock.",
        "Benjamin described which salesman had claimed that Richard would have angrily yelled at for the faulty merchandise in stock."
    ],
    [
        "Ingrid reported which emperor it appeared that his advisors might have secretly conspired with to plan imprisoning many local revolutionaries.",
        "Ingrid reported which emperor it appeared that Isabel might have secretly conspired with to plan imprisoning many local revolutionaries.",
        "Ingrid reported which emperor had implied that his advisors might have secretly conspired with to plan imprisoning many local revolutionaries.",
        "Ingrid reported which emperor had implied that Isabel might have secretly conspired with to plan imprisoning many local revolutionaries.",
        "Ingrid reported which empress it appeared that his advisors might have secretly conspired with to plan imprisoning many local revolutionaries.",
        "Ingrid reported which empress it appeared that Isabel might have secretly conspired with to plan imprisoning many local revolutionaries.",
        "Ingrid reported which empress had implied that his advisors might have secretly conspired with to plan imprisoning many local revolutionaries.",
        "Ingrid reported which empress had implied that Isabel might have secretly conspired with to plan imprisoning many local revolutionaries."
    ],
    [
        "Allan forgot which sorceress it seemed that her enemies would have gladly fought against during the battle in the novel.",
        "Allan forgot which sorceress it seemed that Kevin would have gladly fought against during the battle in the novel.",
        "Allan forgot which sorceress had admitted that her enemies would have gladly fought against during the battle in the novel.",
        "Allan forgot which sorceress had admitted that Kevin would have gladly fought against during the battle in the novel.",
        "Allan forgot which sorcerer it seemed that her enemies would have gladly fought against during the battle in the novel.",
        "Allan forgot which sorcerer it seemed that Kevin would have gladly fought against during the battle in the novel.",
        "Allan forgot which sorcerer had admitted that her enemies would have gladly fought against during the battle in the novel.",
        "Allan forgot which sorcerer had admitted that Kevin would have gladly fought against during the battle in the novel."
    ],
    [
        "Leah didn't know which farmer it seemed that his helpers might have accidentally ripped off at the market on Sunday afternoon.",
        "Leah didn't know which farmer it seemed that Carolyn might have accidentally ripped off at the market on Sunday afternoon.",
        "Leah didn't know which farmer had said that his helpers might have accidentally ripped off at the market on Sunday afternoon.",
        "Leah didn't know which farmer had said that Carolyn might have accidentally ripped off at the market on Sunday afternoon.",
        "Leah didn't know which milkmaid it seemed that his helpers might have accidentally ripped off at the market on Sunday afternoon.",
        "Leah didn't know which milkmaid it seemed that Carolyn might have accidentally ripped off at the market on Sunday afternoon.",
        "Leah didn't know which milkmaid had said that his helpers might have accidentally ripped off at the market on Sunday afternoon.",
        "Leah didn't know which milkmaid had said that Carolyn might have accidentally ripped off at the market on Sunday afternoon."
    ],
    [
        "Jack reported which policewoman it appeared that her back-up might have unintentionally shot at in the basement during the firefight.",
        "Jack reported which policewoman it appeared that Eric might have unintentionally shot at in the basement during the firefight.",
        "Jack reported which policewoman had admitted that her back-up might have unintentionally shot at in the basement during the firefight.",
        "Jack reported which policewoman had admitted that Eric might have unintentionally shot at in the basement during the firefight.",
        "Jack reported which policeman it appeared that her back-up might have unintentionally shot at in the basement during the firefight.",
        "Jack reported which policeman it appeared that Eric might have unintentionally shot at in the basement during the firefight.",
        "Jack reported which policeman had admitted that her back-up might have unintentionally shot at in the basement during the firefight.",
        "Jack reported which policeman had admitted that Eric might have unintentionally shot at in the basement during the firefight."
    ]
]