[
    [
        "I know who Brandon's current talking to distracted recently.",
        "I know that Brandon's current talking to Jennifer distracted recently.",
        "I know who Brandon's current talking to distracted you recently.",
        "I know that Brandon's current talking to Jennifer distracted you recently."
    ],
    [
        "I know what the political campaign to save caused people to hurt nonetheless.",
        "I know that the political campaign to save the rain forests caused people to hurt nonetheless.",
        "I know what the political campaign to save caused people to hurt wildlife nonetheless.",
        "I know that the political campaign to save the rain forests caused people to hurt wildlife nonetheless."
    ],
    [
        "I know who the idea that Melissa really loved shocked today.",
        "I know that the idea that Melissa really loved Jessica shocked today.",
        "I know who the idea that Melissa really loved shocked you today.",
        "I know that the idea that Melissa really loved Jessica shocked you today."
    ],
    [
        "I know who the idea that Michael actually liked surprised today.",
        "I know that the idea that Michael actually liked James surprised today.",
        "I know who the idea that Michael actually liked surprised you today.",
        "I know that the idea that Michael actually liked James surprised you today."
    ],
    [
        "I know who the rumor that Nicole secretly hated surprised yesterday.",
        "I know that the rumor that Nicole secretly hated James surprised yesterday.",
        "I know who the rumor that Nicole secretly hated surprised Matthew yesterday.",
        "I know that the rumor that Nicole secretly hated James surprised Matthew yesterday."
    ],
    [
        "I know who Ashley's current talking to bothered yesterday.",
        "I know that Ashley's current talking to David bothered yesterday.",
        "I know who Ashley's current talking to bothered you yesterday.",
        "I know that Ashley's current talking to David bothered you yesterday."
    ],
    [
        "I know who Timothy's current friendship with bothered yesterday.",
        "I know that Timothy's current friendship with David bothered yesterday.",
        "I know who Timothy's current friendship with bothered Matthew yesterday.",
        "I know that Timothy's current friendship with David bothered Matthew yesterday."
    ],
    [
        "I know who the rumor that William secretly fancied shocked yesterday.",
        "I know that the rumor that William secretly fancied James shocked yesterday.",
        "I know who the rumor that William secretly fancied shocked Matthew yesterday.",
        "I know that the rumor that William secretly fancied James shocked Matthew yesterday."
    ],
    [
        "I know who the fact that Brandon actually liked irritated today.",
        "I know that the fact that Brandon actually liked Jessica irritated today.",
        "I know who the fact that Brandon actually liked irritated you today.",
        "I know that the fact that Brandon actually liked Jessica irritated you today."
    ],
    [
        "I know who Daniel's recent praising of bothered recently.",
        "I know that Daniel's recent praising of David bothered recently.",
        "I know who Daniel's recent praising of bothered you recently.",
        "I know that Daniel's recent praising of David bothered you recently."
    ],
    [
        "I know who the idea that Daniel really fancied shocked yesterday.",
        "I know that the idea that Daniel really fancied Jessica shocked yesterday.",
        "I know who the idea that Daniel really fancied shocked you yesterday.",
        "I know that the idea that Daniel really fancied Jessica shocked you yesterday."
    ],
    [
        "I know who Nicole's recent praising of bothered lately.",
        "I know that Nicole's recent praising of David bothered lately.",
        "I know who Nicole's recent praising of bothered Matthew lately.",
        "I know that Nicole's recent praising of David bothered Matthew lately."
    ],
    [
        "I know who the rumor that Timothy absolutely fancied surprised yesterday.",
        "I know that the rumor that Timothy absolutely fancied Jessica surprised yesterday.",
        "I know who the rumor that Timothy absolutely fancied surprised Matthew yesterday.",
        "I know that the rumor that Timothy absolutely fancied Jessica surprised Matthew yesterday."
    ],
    [
        "I know who Eric's recent praising of distracted lately.",
        "I know that Eric's recent praising of Christopher distracted lately.",
        "I know who Eric's recent praising of distracted Matthew lately.",
        "I know that Eric's recent praising of Christopher distracted Matthew lately."
    ],
    [
        "I know what the legislation to save made people hurt nonetheless.",
        "I know that the legislation to save nature made people hurt nonetheless.",
        "I know what the legislation to save made people hurt plants nonetheless.",
        "I know that the legislation to save nature made people hurt plants nonetheless."
    ],
    [
        "I know who the fact that Ashley actually fancied irritated today.",
        "I know that the fact that Ashley actually fancied Jessica irritated today.",
        "I know who the fact that Ashley actually fancied irritated Matthew today.",
        "I know that the fact that Ashley actually fancied Jessica irritated Matthew today."
    ],
    [
        "I know who the idea that Eric secretly hated surprised today.",
        "I know that the idea that Eric secretly hated Joshua surprised today.",
        "I know who the idea that Eric secretly hated surprised you today.",
        "I know that the idea that Eric secretly hated Joshua surprised you today."
    ],
    [
        "I know who Michael's current talking to annoyed lately.",
        "I know that Michael's current talking to Christopher annoyed lately.",
        "I know who Michael's current talking to annoyed you lately.",
        "I know that Michael's current talking to Christopher annoyed you lately."
    ],
    [
        "I know who William's current attitude towards annoyed lately.",
        "I know that William's current attitude towards David annoyed lately.",
        "I know who William's current attitude towards annoyed Matthew lately.",
        "I know that William's current attitude towards David annoyed Matthew lately."
    ],
    [
        "I know who Melissa's current talking to bothered yesterday.",
        "I know that Melissa's current talking to Jennifer bothered yesterday.",
        "I know who Melissa's current talking to bothered Matthew yesterday.",
        "I know that Melissa's current talking to Jennifer bothered Matthew yesterday."
    ],
    [
        "I know who John's recent friendship with worried recently.",
        "I know that John's recent friendship with Jennifer worried recently.",
        "I know who John's recent friendship with worried you recently.",
        "I know that John's recent friendship with Jennifer worried you recently."
    ],
    [
        "I know what the attempt to overhaul finally destroyed nevertheless.",
        "I know that the attempt to overhaul the ceiling finally destroyed nevertheless.",
        "I know what the attempt to overhaul finally destroyed it nevertheless.",
        "I know that the attempt to overhaul the ceiling finally destroyed it nevertheless."
    ],
    [
        "I know what the recommendation to preserve caused people to harm nevertheless.",
        "I know that the recommendation to preserve the environment caused people to harm nevertheless.",
        "I know what the recommendation to preserve caused people to harm plants nevertheless.",
        "I know that the recommendation to preserve the environment caused people to harm plants nevertheless."
    ],
    [
        "I know what the suggestion to help caused people to harm nevertheless.",
        "I know that the suggestion to help the rain forests caused people to harm nevertheless.",
        "I know what the suggestion to help caused people to harm wildlife nevertheless.",
        "I know that the suggestion to help the rain forests caused people to harm wildlife nevertheless."
    ]
]