[
    [
        "I know who Eric humiliated last year and made peace with lately.",
        "I know that Eric humiliated Jennifer last year and made peace with lately.",
        "I know who Eric humiliated last year and made peace with you lately.",
        "I know that Eric humiliated Jennifer last year and made peace with you lately."
    ],
    [
        "I know what Ashley searched everywhere for yesterday and will donate tonight.",
        "I know that Ashley searched everywhere for food yesterday and will donate tonight.",
        "I know what Ashley searched everywhere for yesterday and will donate fish tonight.",
        "I know that Ashley searched everywhere for food yesterday and will donate fish tonight."
    ],
    [
        "I know who Michael saw and played with yesterday.",
        "I know that Michael saw David and played with yesterday.",
        "I know who Michael saw and played with Matthew yesterday.",
        "I know that Michael saw David and played with Matthew yesterday."
    ],
    [
        "I know what William bought yesterday and will serve today.",
        "I know that William bought food yesterday and will serve today.",
        "I know what William bought yesterday and will serve it today.",
        "I know that William bought food yesterday and will serve it today."
    ],
    [
        "I know who Timothy texted last year and started to like lately.",
        "I know that Timothy texted Jennifer last year and started to like lately.",
        "I know who Timothy texted last year and started to like Matthew lately.",
        "I know that Timothy texted Jennifer last year and started to like Matthew lately."
    ],
    [
        "I know what Brandon purchased yesterday and will distribute tomorrow.",
        "I know that Brandon purchased bread yesterday and will distribute tomorrow.",
        "I know what Brandon purchased yesterday and will distribute fish tomorrow.",
        "I know that Brandon purchased bread yesterday and will distribute fish tomorrow."
    ],
    [
        "I know what Daniel looked for yesterday and will distribute today.",
        "I know that Daniel looked for candy yesterday and will distribute today.",
        "I know what Daniel looked for yesterday and will distribute it today.",
        "I know that Daniel looked for candy yesterday and will distribute it today."
    ],
    [
        "I know what Nicole purchased yesterday and will donate quickly.",
        "I know that Nicole purchased cheese yesterday and will donate quickly.",
        "I know what Nicole purchased yesterday and will donate snacks quickly.",
        "I know that Nicole purchased cheese yesterday and will donate snacks quickly."
    ],
    [
        "I know what Melissa bought yesterday and will donate soon.",
        "I know that Melissa bought bread yesterday and will donate soon.",
        "I know what Melissa bought yesterday and will donate fish soon.",
        "I know that Melissa bought bread yesterday and will donate fish soon."
    ]
]